content-org/posts.org
#+Hugo_base_dir: ../
** DONE Siouxsie Miscellanea :@miscellanea:@music:musical_stalking:siouxsie_and_the_banshees:
:PROPERTIES:
:EXPORT_FILE_NAME: note5
:EXPORT_DATE: 2025-10-26
:END:

For various reasons, I have been @@html:{{< backlink "note4" "reading" >}}@@ a lot about SatB recently.
They're a fascinating group of people and there's a lot of interviews and whatnot that they've done.
Some interesting tidbits from the recent readings:

*** The Johns
There were three Johns who played guitar for the Banshees: McKay, McGeoch, and
@@html:{{< sidenote "Carruthers." >}}John Valentine Carruthers, which is a great name that rivals my own. There's just something about it.{{< /sidenote >}}@@
McKay is well-attested to: in addition to his excellent work on the first two albums, he and drummer Kenny Morris were the subject of "Drop Dead/Celebration," the vicious diss track that opened the /Kaleidoscope/ era.
He also has an [[https://en.wikipedia.org/wiki/Sixes_and_Sevens][album]] of old recordings out this year, which are quite good.
Previously, the only stuff he had out after SatB that I could find was a single as a member of Zor Gabor, "Tightrope," and it was really good.
This is more of the same style, jagged and muscular guitarwork complemented by sufficiently gothic sioux-alike vocals, though it doesn't quite reach "Tightrope"'s pinnacle.
Nevertheless, the first track is a ripper.

John McGeoch also had a storied career, having been in Magazine before SatB and
@@html:{{< sidenote "PiL" >}}Post-Flowers of Romance, unfortunately.{{< /sidenote >}}@@
afterwards.
However, I cannot find anything about what happened to Carruthers after he was kicked from the band.
I'm not even entirely sure why he was kicked, which is curious.
You'd think that there would at least be /something/ out there!

*** Geraldo Pino

Hyaena is one of my least favorite Siouxsie albums (in the same sense that caramel is my least favorite ice cream flavor)
because its production reminds me of a boy's locker room after PE, and also because leans a bit too far towards exotica.
The band was always obsessed with the strange, and what's stranger than a foreigner?
Hence the somewhat
@@html:{{< sidenote "misinformed" >}}The questions Siouxsie got in interviews about her stage name, and the answers she gave, are good for a awkward laugh.{{< /sidenote >}}@@
"Hong Kong Garden" and "Arabian Nights," which are both catchy songs but also represent, to me, the band at its weakest.
A good chunk of Hyaena has this sort of dynamic, and a clear example is "[[https://www.youtube.com/watch?v=x9kqoDbAtIM][Take Me Back]]," which draws its keyboard melodies from '70s afro-funk.
A point of reference is Geraldo Pino's "[[https://youtu.be/EDUbBh74iG8?t=43][Let Them Talk]]," which has the same pattern with the chorus and a similar pentatonic thing going on with the
@@html:{{< sidenote "organ," >}}Can you tell that I don't know my theory?{{< /sidenote >}}@@
which also has a similar tone.
Siouxsie's version is supposed to be colder and creepier but I think it comes off as anemic.


*** Julie Burchill

In my
@@html:{{< backlink "post3" "music criticism" >}}@@
post, I noted that the mean reviews that were seemingly more common in the past are both fun to read and are often more representative of the writer's ignorance than the music itself.
Julie Burchill's [[https://punkrocker.org.uk/punkinterviews/siouxsiereview.html][review]] of /The Scream/ in NME is a great example of this.
I hadn't heard of Burchill until recently, but I have come to understand that she is a personality in Britain who started off writing bad opinions on music and then expanded to writing bad opinions on everything else, from Iraq to trans people.
If you're against her on those fronts, you'll be glad to know that this review is 90% bullshit, but it's the /why/ that's interesting.

Burchill might have been the platonic ideal of a bad rock critic, because she seemed to think that [[https://x.com/nme1980s/status/1807845374784114715/photo/1][all music is written for her]], generally faced backwards, and was a bit of a [[https://archive.is/XGXOG][troll]].
If Lester Bangs had a stick up his intestine and was drugged incoherent... he would still be more readable and more insightful.
It is no surprise, therefore, that Burchill dogmatically despised punk.
Anyways, I find the style of the review interesting. When Burchill says "I will NOT tolerate over-made-up, non-starter gangs in my classroom," about Japan and Ultravox, it's probably sincere criticism disguised as sarcasm.
It is also the second most sensical sentence in the review.
The rest of the piece is a surprisingly angry tirade—against dressing a certain way ("wear a mass of make-up and look asexual"), instrumentals ("as pretentious as shit"), and speaking ("blind the critics with words and silence").
To this, Siouxie's [[https://web.archive.org/web/20091022132945/http://www.geocities.com/vintageinterviews/siouxsie.html][response]]—also in NME—is a good one:

"If someone said something genuinely constructive but heavily critical — and on reasonable grounds — it would sink in a lot more.
I wouldn't just think they were being stupid for no reason at all. I'd probably question it with myself... She's not doing anything being a journalist, just being negative."

The flip side is that she's right on the money regarding Siouxsie's flirtations with fascist imagery at the time.
In addition to her wearing a Nazi swastika in '76 (two years before this review), an earlier version of "Love in a Void" had the line "too many Jews for my liking," though it didn't make the single.
The justifications have been varied enough to merit [[https://researchprofiles.ku.dk/en/activities/no-matter-how-often-i-explain-it-the-hermeneutics-of-siouxsie-sio/][academic scrutiny]], and it seems as though many punk journalists were soft on that sort of thing.
Times have changed, as the response to more [[https://www.reddit.com/r/kpop/comments/11xl1fd/chaeyoung_twice_apologizes_for_the_recent_shirt/][recent]] and unintentional uses of the Nazi swastika suggests, and Siouxsie's usage of it is a pretty common criticism levied against her now.
It's a very different context from NSBM, of course, but it's also pretty instructive as to how reflexive contrarianism can lead young people to the right.
Just look at Johnny Rotten's politics!
Julie reveals herself, however, in castigating Jewish critics for being insufficiently mad about it.
Weaponizing identity is a pattern for her, and one must respect the fact that she learned how to do so well before it became fashionable.
